# <center>AV3 - Ambiente de Dados</center>

In [1]:
# Importa nossas funções
from funcs import *

## 3.0) CRUD de uma entidade
Utilizando linguágem de programa, faça um programa que realiza o CRUD* de pelo menos 1 entidade do seu Diagrama Entidade Relacionamento

* <b>Ler</b>

In [2]:
# Exibir todas as entidades da tabela fornecida
mostrar_registros('cliente')

   id              nome  nascimento  tipo_de_cliente
0   1      João Antônio  1996-07-31                1
1   2             Pedro  1996-07-31                1
2   3  Franciso Alberto  1996-07-31                1
3   4         Maria Ana  1996-07-31                2
4   5   Marta de Castro  1996-07-31                2

* <b>Criar</b>

In [3]:
# Criar nova entidade
dados_insercao = {'nome': 'Carlos', 'nascimento': '1996-07-31 00:00:00', 'tipo_de_cliente': 1}
inserir_registro('cliente', dados_insercao)

# Exibir todas as entidades da tabela
mostrar_registros('cliente')

Registro inserido com sucesso!

   id              nome  nascimento  tipo_de_cliente
0   1      João Antônio  1996-07-31                1
1   2             Pedro  1996-07-31                1
2   3  Franciso Alberto  1996-07-31                1
3   4         Maria Ana  1996-07-31                2
4   5   Marta de Castro  1996-07-31                2
5  20            Carlos  1996-07-31                1

In [4]:
# Pegar o id do ultimo registro criado, vai ser usado para alterar e depois para deletar ele
id_escolhido = ultimo_id('cliente')

* <b>Alterar</b>

In [5]:
# Atualizar entidade
novos_dados_atualizacao = {'nome': 'Novo nome','tipo_de_cliente': 3}
atualizar_registro('cliente', id_escolhido, novos_dados_atualizacao)

# Exibir todas as entidades da tabela
mostrar_registros('cliente')

Registro atualizado com sucesso!

   id              nome  nascimento  tipo_de_cliente
0   1      João Antônio  1996-07-31                1
1   2             Pedro  1996-07-31                1
2   3  Franciso Alberto  1996-07-31                1
3   4         Maria Ana  1996-07-31                2
4   5   Marta de Castro  1996-07-31                2
5  20         Novo nome  1996-07-31                3

* <b>Deletar</b>

In [6]:
# Excluir entidade
excluir_registro('cliente', id_escolhido)

# Exibir todas as entidades da tabela
mostrar_registros('cliente')

Registro excluído com sucesso!

   id              nome  nascimento  tipo_de_cliente
0   1      João Antônio  1996-07-31                1
1   2             Pedro  1996-07-31                1
2   3  Franciso Alberto  1996-07-31                1
3   4         Maria Ana  1996-07-31                2
4   5   Marta de Castro  1996-07-31                2

<hr>

## 3.2) Utilizar transação nos INSERTS

In [7]:
# Inserir dados usando transação
dados_insercao = {'nome': 'Carlos', 'nascimento': '1996-07-31 00:00:00', 'tipo_de_cliente': 1}
inserir_registro('cliente', dados_insercao)

# Exibir registros
df = fazer_consulta('SELECT * FROM Cliente')

Registro inserido com sucesso!

<hr>

## 3.3) Cadastro em massa CSV

* Criar um método para cadastrar em massa dados provenientes de um arquivo CSV. Obrigatoriamente os INSERTS realizados nesta atividades devem ser inseridos no banco através de uma única transação.

In [8]:
# Exclui todos os registros da tabela venda e cliente
excluir_todos_registros('venda')
excluir_todos_registros('cliente')

Todos os registros da tabela foram excluídos com sucesso!
Todos os registros da tabela foram excluídos com sucesso!

In [9]:
# Adiciona todos os registros do arquivo CSV na tabela cliente e na tabela venda
cadastrar_em_massa_dados_csv('cliente', 'tabelas_prontas/cliente.csv')
cadastrar_em_massa_dados_csv('venda', 'tabelas_prontas/venda.csv')

Registros inseridos com sucesso!
Registros inseridos com sucesso!

<hr>

## 3.1) Consulta utilizando Join

* Mostrar os ultimo clientes a que a loja vendeu

In [12]:
consulta = """
SELECT
    C.nome AS 'Cliente',
    V.id_cliente, 
    V.data_hora AS 'Data',
    V.endereco_de_envio AS 'Endereço'
    
FROM Venda V
    INNER JOIN Cliente C
        ON V.id_cliente = C.id

ORDER BY V.data_hora DESC;
"""

# Retorna um Dataframe com o resultado da consulta sql
df = fazer_consulta(consulta)
df

        Cliente  id_cliente                Data               Endereço
0  João Antônio           1 2023-12-03 13:00:00   Rua dos Alfeneiros 4
1         Pedro           2 2023-12-02 10:00:00       Rua dos Bobos N0
2         Pedro           2 2023-12-02 05:00:00       Rua dos Bobos N0
3  João Antônio           1 2023-12-01 12:45:00  Rua dos Jogadores 123
4         Pedro           2 2023-12-01 09:00:00       Rua dos Bobos N0

<hr>

## 3.4) Realizar uma exportação para CSV de uma consulta executada no banco.

In [11]:
gravar_csv(df, 'ComprasClientes.csv')

Arquivo gravado com sucesso!